/*'number'+3+3  даний вираз,
'number' це вираз у '' ,тому має тип даних  string ,
a 3 =число, + між рядком і числом перетворює число в рядок і виконує конкатенацію.
'number3' + 3, 
ще один + перетворю число 3 в рядок і знову виконує конкатенацію.
Очікуваний результат 'number33'
*/
console.log ('number' + 3 + 3);
/* null + 3 початковий вираз,
далі відбувається перетворення null в число, це буде 0,
після виконується додавання 
Очікуваний результат 3
*/
console.log (null + 3);

/* 5 && 'qwerty' початковий вираз,де && є логічним і, воно перетворює 5 в значення true.
 Оператор && перевіряє другий операнд  'qwerty' ,так як він не пустий рядок,
 то має значення true
 Очікуваний результат 'qwerty'

*/
console.log(5 && 'qwerty');
/* +'40' + +'2' + 'hillel' початковий вираз,де + перетворює рядок '40' в число 40 за правилом ,
також +'2' перетворюється в число 2,
після того , як вийшли перетворення , 40 + 2 + 'hillel',виконуємо другу операцію ,
 за правилом коли один із операндів рядок,виконується конкантанація. 
 Очікуваний результат '42hillel'
*/ 
console.log(+'40' + +'2' + 'hillel');
/*  '10' - 5 === 6 початковий вираз,'10' при відніманні буде числом 10 ,тобто
 виконується операція віднімання  10-5=5,
 Оператор строгої рівності === === виконується порівняння,не тільки по значенню а і по типу,
  Оскільки 5 не дорівнює 6, порівняння дасть результат false.

*/ 
console.log('10' - 5 === 6);
/*  true + false початковий вираз , true = 1, а 
false = 0 
Очікуваний результат 1 
*/
console.log(true + false );
/* '4px' - 3 початковий вираз,виконується операція віднімання , але '4px' string і віднімання намагається 
перетворити '4px' в число але там є літери. Це не число тому результат NAN.
Не можна виконати операцію з string , що містить нечислові символи , результатом буде NaN.
*/
console.log('4px' - 3 );

/* '4' - 3 початковий вираз,де '4'в результаті віднімання перетворюється начисло 4.
Очікуваний результат 4-3= 1

*/
console.log('4' - 3);
/* '6' + 3 ** 0  початковий вираз, де ** значать степень , тобто 3 піднситься в степінь 0 , 
це дорівнює 1 , а '6' це string і в результаті додавання виконується 
операція конкатенації додавання рядків,
з цього виходить що очікування результат '61'
*/
console.log('6' + 3 ** 0);
/* 12 / '6' початковий вираз , де операція ділення перетворює string '6' в числове значення 6 , 
за правилом, виходячи з цього очікуванний результат 12/6=2 
*/
console.log(12 / '6');
/* '10' + (5 === 6) початковий вираз , === порівнює значення і типи.
Оскільки 5 не дорівнює 6 то результат порівняння буде false.Далі виконується результат додавання 
та операція конкатенації стрінгів.
Очікуваний результат буде '10' + 'false'тобто '10false'.
*/
console.log('10' + (5 === 6));
/* null == '' початковий вираз, де '' порожній стрінг,не має жодних символів. 
null тип, який представляє відсутність значення або об'єкта.
== оператор яки1 порівнює два значення, автоматично приводячи їх до одного типу перед порівнянням.
Виходячи з цього null не дорівлює порожньому стрінгу і очікуваний результат false
*/
console.log(null == '');

/*
3 ** (9 / 3) початковий вираз , де виконується операція ділення , в результаті 9/3 виходить 3 ,
після 3 підноситься до степеня 3.
Очікуваний результат 27
*/
console.log(3 ** (9 / 3));
/*
!!'false' == !!'true' початковий вираз , де !! операція подвійного заперечення ,
!! повертають значення, яке було приведене до булевого типу,
!!'false' дає true тому що 'false' це непорожній стрінг і також
!!'true' дає true , тому що 'true' це також непорожній рядок).
Порівняння true == true: Після приведення обох значень до булевого типу, 
ми маємо порівняння: true == true, що дає true.
*/
console.log(!!'false' == !!'true');
/* 0 || '0' && 1 початковий вираз ,де 
оператор && має вищий пріоритет, ніж ||.Тому спочатку виконується операція &&, а потім ||. 
результат виразу 0 || '0' && 1 = 1, 
оскільки пріоритет оператора && спочатку обчислює результат як 1, 
і потім вже
застосовується оператор ||, який повертає 1.

*/
console.log(0 || '0' && 1);
/*(+null == false)  < 1 початковий вираз, де почнемо +null , + перетворює null в число 0 ,
далі 0 == false, де 0 порівнюємо з false і це вийде true,бо false при приведенні до числа стає 0.
Далі true < 1 
при приведенні true до числа це буде 1 , і тому вираз буде такий 1<1 це буде значення false 
З цього виходить , +null == false < 1 — true
 так як  +null == false дає true а порівняння true < 1 дає false.
*/
console.log((+null == false)) < 1;
/* false && true || true початковий вираз , де && сає більший пріорітет ніж || 
тому роюбимо операцію false && true,
&& повертає false,якщо хоча б один з операндів є false.Тоді,
 оскільки перший операнд — це false,результат операції false && true буде false.
 Далі виконуємо false || true ,згідно з правилом 
 || повертає true, якщо хоча б один з операндів є true.
В нас  другий операнд — це true, результат операції буде true.
*/
console.log( false && true || true);
/* 
false && (false || true) початковий вираз , де спочатку виконується операція в двужках, 
|| повертає true , якщо хоч одне зі значень true ,
далі виконується операція false && true, а от && повертає false ,якщо хоч одне із значень false
Тому очікуваний результат буде false
*/
console.log(false && (false || true));
/* 
(+null == false) < 1 ** 5  початковий вираз , де почнемо з того зо + перетворює null на число 
null=0 в даному випадку, далі порівнюємо 0 з false , 
як вже відомо false при приведенні до числа стає 0.
Далі при порівннянні буде true так як 0 порівняється з 0 
1 ** 5 , підносимо 1 в 5 ступінь, буде 1
далі порівнюємо true s 1 , при приведенні true в число буде 1 
тобто 1 <1 це false 
*/
console.log((+null == false) < 1 ** 5);





















